# 1 - Expresiones Regulares

Las funciones del módulo re se dividen en tres categorías:
    
* Pattern matching

* Sustitución

* Split

## Split

In [1]:
import re

regex = re.compile("\s+", flags = re.IGNORECASE)

text = "foo      bar \t bas \tqux"
regex.split(text)

['foo', 'bar', 'bas', 'qux']

## Pattern matching

In [2]:
#listo todas las partes que hacen match con la expresión regular:
regex.findall(text)

['      ', ' \t ', ' \t']

In [3]:
# search devuelve solo el primer match:
regex.search(text)

In [4]:
# match sólo intenta al comienzo del string:
regex.match(text)

In [5]:
# match sólo intenta al comienzo del string:
regex.match('   ' + text)

## Sustitución

In [6]:
regex.sub(' [espacios] ', text)

'foo [espacios] bar [espacios] bas [espacios] qux'

# 2 - Apply - Applymap

In [7]:
import pandas as pd
import numpy as np
import math
 
d = {'Score_Math':pd.Series([66,57,75,44,31,67,85,33,42,62,51,47]),
   'Score_Science':pd.Series([89,87,67,55,47,72,76,79,44,92,93,69])}
 
df = pd.DataFrame(d)
df

    Score_Math  Score_Science
0           66             89
1           57             87
2           75             67
3           44             55
4           31             47
5           67             72
6           85             76
7           33             79
8           42             44
9           62             92
10          51             93
11          47             69

In [8]:
df.apply(np.mean,axis=1)

0     77.5
1     72.0
2     71.0
3     49.5
4     39.0
5     69.5
6     80.5
7     56.0
8     43.0
9     77.0
10    72.0
11    58.0
dtype: float64

In [9]:
df.apply(np.mean,axis=0)

Score_Math       55.0
Score_Science    72.5
dtype: float64

In [10]:
df.applymap(lambda x:x*2)

    Score_Math  Score_Science
0          132            178
1          114            174
2          150            134
3           88            110
4           62             94
5          134            144
6          170            152
7           66            158
8           84             88
9          124            184
10         102            186
11          94            138

In [11]:
def resto1(x):
    result = x -1
    return result

df.applymap(resto1)

    Score_Math  Score_Science
0           65             88
1           56             86
2           74             66
3           43             54
4           30             46
5           66             71
6           84             75
7           32             78
8           41             43
9           61             91
10          50             92
11          46             68

In [12]:
def sumo_celdas(x):    
    result = x[0] + x[1]
    return(result)

# suma las dos columnas de cada fila
suma_por_registro = df.apply(sumo_celdas, axis=1)
print(suma_por_registro)

# suma las dos primeras filas de cada columna
suma_por_variable = df.apply(sumo_celdas, axis=0)
print(suma_por_variable)

0     155
1     144
2     142
3      99
4      78
5     139
6     161
7     112
8      86
9     154
10    144
11    116
dtype: int64
Score_Math       123
Score_Science    176
dtype: int64